Repository: Belfagor2005/OAWeather-Pli
Catalog: usr/lib/enigma2/python/Plugins/Extensions/OAWeather/locale/*/LC_MESSAGES/OAWeather.po
Languages: ar, it, sr

source: %d Minutes
ar: %d دقائق
it: %d Minuti
sr: %d Minuta

source: Add
it: Aggiungere
sr: Dodaj

source: Add Fav
it: Aggiungi ai preferiti
sr: Dodaj Favorit

source: Cache data :
ar: بيانات الكاش
it: Dati nella cache:
sr: Keš podataka:

source: Choose the icon set. You need to create an additional set here: /usr/share/enigma2/WeatherIconSets/NAME.
ar: اختر مجموعة الأيقونات. يجب عليك إنشاء مجموعة إضافية هنا: /usr/share/enigma2/WeatherIconSets/NAME.
it: Scegli il set di icone. Devi creare un set aggiuntivo in: /usr/share/enigma2/WeatherIconSets/NAME.

source: Choose whether the 'night switch' should be activated or not. Some icons are then displayed as night icons with moon.
ar: اختر ما إذا كان يجب تفعيل 'التبديل الليلي' أم لا. سيتم عرض بعض الأيقونات كأيقونات ليلية مع القمر.
it: Scegli se attivare o meno la modalità 'notturno'. Alcune icone vengono quindi visualizzate come icone notturne con la luna.

source: Chose favorite
it: Scelta Favorito
sr: Izaberi Favorit

source: City name must be at least 3 characters
it: Il nome della città deve essere composto da almeno 3 caratteri
sr: Ime grada mora imati najmanje 3 znaka

source: Coordinates not available for this location
it: Coordinate non disponibili per questa posizione
sr: Koordinate nisu dostupne za ovu lokaciju

source: Current Weather
ar: الطقس الحالي
it: Meteo corrente
sr: Trenutna Prognoza

source: Day +/-
it: Giorno +/-
sr: Dan +/-

source: Default
it: Predefinito
sr: Zadano

source: Defaults
ar: الافتراضيات
it: Predefiniti
sr: Zadani

source: Delete
it: Eliminare
sr: Izbriši

source: Delete failed
it: Eliminazione non riuscita
sr: Brisanje neuspešno

source: Delete {}?
it: Eliminare {}?
sr: Izbrisati {}?

source: Details +/-
it: Dettagli +/-
sr: Detalji +/-

source: Disabled
ar: معطل
it: Disabilitato
sr: Onemogući

source: East
ar: شرق
it: Est
sr: Istočni

source: Edit
it: Modifica
sr: Uredi

source: Edit city name
it: Modifica il nome della città
sr: Uredi ime grada

source: Enable Debug :
ar: تفعيل التصحيح
it: Abilita debug:
sr: Otvori Degub:

source: Enabled :
ar: مفعل
it: Abilitato:
sr: Omogući:

source: Enter city name (e.g. 'Rome, IT')
it: Inserisci il nome della città (ad esempio "Roma, IT")
sr: Unesite ime grada (npr. 'Rim, IT')

source: Error adding location
it: Errore durante l'aggiunta della posizione
sr: Greška pri dodavanju lokacije

source: Error changing day
it: Errore durante il cambio giorno
sr: Greška menja dan

source: Error processing location data
it: Errore durante l'elaborazione dei dati sulla posizione
sr: Greška u obradi podataka o lokaciji

source: Error saving favorites
it: Errore durante il salvataggio dei preferiti
sr: Greška pri čuvanju favorita

source: Error saving location
it: Errore durante il salvataggio della posizione
sr: Greška pri čuvanju lokacije

source: Error selecting location
it: Errore nella selezione della posizione
sr: Greška pri izboru lokacije

source: Error updating list
it: Errore durante l'aggiornamento della lista
sr: Lista ažuriranja grešaka

source: Exit
it: Esci
sr: Izlaz

source: Favorites saved successfully
it: Preferiti salvati con successo
sr: Favoriti sačuvani uspešno

source: Feels like
ar: يشعر وكأنه
it: Percepiti
sr: Oseća se kao

source: GREEN: MANAGEMENT FAVORITES | MENU: SETUP | INFO: DETAILS | HOME
it: VERDE: GESTIONE PREFERITI | MENU: IMPOSTAZIONI | INFO: DETTAGLI | HOME

source: Glass
it: Zoom
sr: Staklo

source: Humidity
ar: الرطوبة
it: Umidità
sr: Vlažnost

source: Invalid location coordinates
it: Coordinate di posizione non valide
sr: Neispravne koordinate lokacije

source: Invalid location format
it: Formato di posizione non valido
sr: Nevažeći format lokacije

source: Invalid selection
it: Selezione non valida
sr: Nevažeći izbor

source: Less details / Larger font
it: Meno dettagli / Carattere più grande
sr: Manje detalja/Veća slova

source: Loading weather data...
it: Caricamento dati meteo in corso...
sr: Učitavanje vremenskih podataka...

source: Location added successfully
it: Posizione aggiunta correttamente
sr: Lokacija je uspešno dodana

source: Location added to favorites
it: Posizione aggiunta ai preferiti
sr: Lokacija dodata u favorite

source: Location already exists
it: La posizione esiste già
sr: Lokacija već postoji

source: Location already in favorites
it: Questa posizione è già tra i preferiti
sr: Lokacija je već u favoritima

source: Location deleted
it: Posizione cancellata
sr: Lokacija izbrisana

source: Location with similar coordinates already exists
it: Esiste già una posizione con coordinate simili
sr: Lokacija sa sličnim koordinatama već postoji

source: MSN weather
ar: طقس MSN
it: Meteo MSN
sr: MSN prognoza

source: Manage Favorites
it: Gestione Preferiti
sr: Upravljanje Favoritima

source: More Details / Smaller font
it: Maggiori dettagli / Carattere più piccolo
sr: Više Detalja/Manje Slovo

source: Next favorite
it: Prossimo favorito
sr: Sledeći Favorit

source: No locations found
it: Nessuna posizione trovata
sr: Nije pronađena lokacija

source: North
ar: شمال
it: Nord
sr: Severni

source: Northeast
ar: شمال شرق
it: Nord Est
sr: Severo Istočni

source: Northwest
ar: شمال غرب
it: Nord Ovest
sr: Severo Zapadni

source: Open-Meteo Wetter
ar: Open-Meteo
it: Open-Meteo
sr: Otvori-Vremensku Prognozu

source: Please enter a valid city name.
it: Inserisci un nome di città valido.
sr: Unesite važeće ime grada.

source: Please enter at least 3 characters
it: Inserisci almeno 3 caratteri
sr: Molimo Vas da unesete najmanje 3 znaka

source: Precipitation
ar: هطول الأمطار
it: Precipitazioni
sr: Padavine

source: Previous favorite
it: Favorito precedente
sr: Predhodni Favorit

source: Refresh interval :
ar: فاصل التحديث
it: Intervallo aggiornamento:
sr: Interval Osvežavanja:

source: Save
it: Salva
sr: Sačuvaj

source: Select 'Yes' to enable add debug output to log.
ar: اختر 'نعم' لتمكين إضافة مخرجات التصحيح إلى السجل.
it: Seleziona 'Si' per abilitare il debug nel file log.

source: Select 'Yes' to enable the addition of Weather.
ar: اختر 'نعم' لتمكين إضافة الطقس.
it: Seleziona 'Si' per abilitare l'aggiunta del Meteo.

source: Select location
it: Seleziona la posizione
sr: Izaberi Lokaciju

source: Select the City and Press Ok
it: Seleziona la città e premi Ok
sr: Izaberite grad i pritisnite OK

source: Select the preferred weather service to supply the weather information.
ar: اختر خدمة الطقس المفضلة لتوفير معلومات الطقس.
it: Seleziona il servizio meteo preferito per fornire le informazioni meteo.

source: Select the temperature unit to be used for temperature displays.
ar: اختر وحدة درجة الحرارة لاستخدامها في عرض درجات الحرارة.
it: Seleziona l'unità di temperatura da utilizzare per la visualizzazione della temperatura.

source: Select this option to save that last obtained weather data locally. This is used to initialize the data immediately after restart while updated data is being fetched.
ar: اختر هذا الخيار لحفظ آخر بيانات الطقس التي تم الحصول عليها محليًا. يُستخدم هذا لتهيئة البيانات فورًا بعد إعادة التشغيل أثناء جلب البيانات المحدثة.
it: Seleziona per salvare localmente gli ultimi dati meteorologici ottenuti. Viene utilizzato per inizializzare i dati immediatamente dopo il riavvio durante il recupero dei dati aggiornati.

source: Show Weather Forecast
ar: إظهار توقعات الطقس
it: Mostra le previsioni Meteo
sr: Predviđena Vremenska Prognoza

source: South
ar: جنوب
it: Sud
sr: Južni

source: Southeast
ar: جنوب شرق
it: Sud Est
sr: Jugo Istočni

source: Southwest
ar: جنوب غرب
it: Sud Ovest
sr: Jugo Zapadni

source: Specify how often Weather retrieves its data from the server. 'Once' means the data will loaded only once after a GUI or system start.
ar: حدد عدد المرات التي يسترجع فيها الطقس بياناته من الخادم. 'مرة واحدة' تعني أن البيانات ستُحمّل مرة واحدة فقط بعد بدء تشغيل واجهة المستخدم أو النظام.
it: Specifica la frequenza con cui il meteo recupera i suoi dati dal server. 'Una volta' significa che i dati verranno caricati solo una volta dopo l'avvio della GUI o del sistema.

source: Standard fertig
it: Fertig standard
sr: Standard gotov

source: Temperature unit :
ar: وحدة درجة الحرارة
it: Unità temperatura:
sr: Temperaturna jedinica:

source: Today
ar: اليوم
it: Oggi
sr: Danas

source: Try refreshing or check settings
it: Prova ad aggiornare o controlla le impostazioni
sr: Pokušajte da osvežite ili proverite podešavanja

source: Update
ar: تحديث
it: Aggiornato
sr: Ažurirano

source: View details
it: Mostra dettagli
sr: Prikaz detalja

source: Weather API key :
ar: مفتاح API للطقس
it: Chiave API Meteo:

source: Weather Plugin Detailview
it: Visualizzazione dettagliata del plugin meteo
sr: Vremenska Prognoza Plugin Detalji

source: Weather city name :
ar: اسم مدينة الطقس
it: Nome della città meteorologica:
sr: Vremenska prognoza grada:

source: Weather data unavailable
it: Dati meteo non disponibili
sr: Vremenski podaci nisu dostupni

source: Weather icon night switch :
ar: تبديل أيقونات الطقس الليلية
it: Attiva icona notturna meteo:
sr: Promena noćne ikone vremenske prognoze:

source: Weather icon set :
ar: مجموعة أيقونات الطقس
it: Set di icone meteo:
sr: Ikone vremenske prognoze:

source: Weather service :
ar: خدمة الطقس
it: Servizio Meteo:
sr: Servis Prognoze:

source: Weather settings
ar: إعدادات الطقس
it: Configurazioni meteo

source: West
ar: غرب
it: Ovest
sr: Zapadni

source: Wind speed metric unit:
ar: وحدة سرعة الرياح
it: Unità di misura della velocità del vento:
sr: Brzina vetra metrička jedinica:

source: You have unsaved changes. Save before exiting?
it: Ci sono modifiche non salvate. Vuoi salvare prima di uscire?
sr: Imate nesačuvane promene. Sačuvaj pre izlaska?

source: exit
it: eci
sr: izlaz

source: Celsius
ar: سيلزيوس
sr: Celzius

source: Menu
sr: Meni

source: No data
sr: Nema podataka

source: Settings
sr: Postavke

source: Setup
sr: Podešavanje

source: Weather Plugin
ar: إضافة الطقس
sr: Plugin Prognoze

source: Cache data
ar: البيانات المخزنة

source: City '%s' not found! Please try another wording.
ar: المدينة '%s' غير موجودة! يرجى تجربة صياغة أخرى.

source: Enable Debug
ar: تمكين التصحيح

source: Enabled
ar: ممكّن

source: Enter a personalized API key for use with OpenWeatherMap (https://openweathermap.org/).
ar: أدخل مفتاح API مخصص للاستخدام مع OpenWeatherMap (https://openweathermap.org/).

source: Enter the location for your weather forecasts.
ar: أدخل الموقع لتوقعات الطقس الخاصة بك.

source: Error getting City ID
ar: خطأ في الحصول على معرف المدينة

source: Error in Weatherinfo
ar: خطأ في معلومات الطقس

source: Fahrenheit
ar: فهرنهايت

source: Location Selection
ar: اختيار الموقع

source: Metric unit for wind speed
ar: وحدة مترية لسرعة الرياح

source: Refresh interval
ar: الفاصل الزمني للتحديث

source: Search for City ID please wait...
ar: جاري البحث عن معرف المدينة، يرجى الانتظار...

source: Search for your City
ar: ابحث عن مدينتك

source: Select Your Location
ar: اختر موقعك

source: Select the metric unit for wind speed to be used for wind displays. This has no effect on the imperial unit 'mph'.
ar: اختر الوحدة المترية لسرعة الرياح لاستخدامها في عرض الرياح. لا يؤثر هذا على الوحدة الإمبراطورية 'ميل/ساعة'.

source: Set default values
ar: تعيين القيم الافتراضية

source: Temperature unit
ar: وحدة درجة الحرارة

source: The API key for OpenWeatherMap is not defined or invalid. Please verify your input data. Otherwise your settings won't be saved.
ar: مفتاح API لـ OpenWeatherMap غير معرف أو غير صالح. يرجى التحقق من البيانات التي أدخلتها. وإلا فلن يتم حفظ إعداداتك.

source: The city name is too short. More than 2 characters are needed for search.
ar: اسم المدينة قصير جدًا. يلزم أكثر من حرفين للبحث.

source: Weather API key
ar: مفتاح API الطقس

source: Weather Settings Actions
ar: إجراءات إعدادات الطقس

source: Weather city name
ar: اسم مدينة الطقس

source: Weather icon night switch
ar: تبديل أيقونات الطقس الليلية

source: Weather icon set
ar: مجموعة أيقونات الطقس

source: Weather service
ar: خدمة الطقس

source: km/h
ar: كم/ساعة

source: m/s
ar: م/ث

source: n/a
ar: غير متوفر
